Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/shijing__all__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 曾孫之稼，如茨如梁，曾孫之庾，如坻如京。 乃求千斯倉，乃求萬斯箱，黍稷稻粱。 農夫之慶，報以介福，萬壽無疆。
en: The crops of the distant descendant Look (thick) as thatch, and (swelling) like a carriage-cover. His stacks will stand like islands and mounds. He will seek for thousands of granaries; He will seek for tens of thousands of carts. The millets, the paddy, and the maize Will awake the joy of the husbandmen; (And they will say), 'May he be rewarded with great happiness, With myriads of years, life without end!'

source: 大田多稼，既種既戒。既備乃事，以我覃耜。 俶載南畝，播厥百穀。既庭且碩，曾孫是若。 既方既皁，既堅既好，不稂不莠。 去其螟螣，及其蟊賊，無害我田穉。 田祖有神，秉畀炎火。 有渰萋萋，興雨祁祁，雨我公田，遂及我私。 彼有不穫穉，此有不斂穧。彼有遺秉，此有滯穗。伊寡婦之利。 曾孫來止，以其婦子，饁彼南畝。田畯至喜。 來方禋祀，以其騂黑。與其黍稷，以享以祀，以介景福。
en: Large are the fields, and various is the work to be done. Having selected the seed, and looked after the implements, So that all preparations have been made for our labour, We take our sharp plough-shares, And commence on the south-lying acres. We sow all the kinds of grain, Which grow up straight and large, So that the wish of the distant descendant is satisfied. It ears and the fruit lies soft in its sheath; It hardens and is of good quality; There is no wolf's-tail grass nor darnel. We remove the insects that eat the heart and the leaf, And those that eat the roots and the joints, So that they shall not hurt the young plants of our fields. May the spirit, the Father of Husbandry, Lay hold of them, and put them in the blazing fire!

source: 交交桑扈，有鶯其羽。君子樂胥，受天之祜。 交交桑扈，有鶯其領。君子樂胥，萬邦之屏。 之屏之翰，百辟為憲。不戢不難，受福不那。 兕觥其觩，旨酒思柔。彼交匪敖，萬福來求。
en: They flit about, the greenbeaks, With their ​variegated wings. To be rejoiced in are these princes! May they receive the blessing of Heaven!

source: 賓之初筵，左右秩秩，籩豆有楚，殽核維旅。 酒既和旨，飲酒孔偕，鐘鼓既設，舉醻逸逸。 大侯既抗，弓矢斯張，射夫既同，獻爾發功。 發彼有的，以祈爾爵。
en: When the guests first approach the mats, They take their places on the left and the right in an orderly manner. The dishes of bamboo and wood are arranged in rows, With the sauces and kernels displayed in them. The spirits are mild and good, And they drink, all equally reverent. The bells and drums are properly arranged, And they raise their pledge-cups with order and ease. (Then) the great ​target is set up; The bows and arrows are made ready for the shooting. The archers are arranged in classes; 'Show your skill in shooting,' (it is said by one). 'I shall hit that mark' (is the response), 'And pray you to drink the cup.'

source: 籥舞笙鼓，樂既和奏，烝衎烈祖，以洽百禮。 百禮既至，有壬有林，錫爾純嘏，子孫其湛。 其湛曰樂，各奏爾能，賓載手仇，室人入又。 酌彼康爵，以奏爾時。
en: The dancers move with their flutes to the notes of the organ and drum, While all the instruments perform in harmony. All this is done to please the meritorious ancestors, Along with the observance of all ceremonies. When all the ceremonies have been fully performed, Grandly and fully, (The personators of the dead say), 'We confer on you great blessings, And may your descendants also be happy!' These are happy and delighted, And each of them exerts his ability. A guest draws the spirits; An attendant enters again with a cup, And fills it,—the cup of rest. Thus are performed your seasonal ceremonies.

source: 白華菅兮，白茅束兮。之子之遠，俾我獨兮。 英英白雲，露彼菅茅。天步艱難，之子不猶。 滮池北流，浸彼稻田。嘯歌傷懷，念彼碩人。 樵彼桑薪，卬烘于煁。維彼碩人，實勞我心。
en: The fibres from the white-flowered rush Are bound with the white grass. This man's sending me away makes me dwell solitary.

source: 鼓鍾于宮，聲聞于外。念子懆懆，視我邁邁。 有鶖在梁，有鶴在林。維彼碩人，實勞我心。 鴛鴦在梁，戢其左翼。之子無良，二三其德。 有扁斯石，履之卑兮。之子之遠，俾我疧兮。
en: The light and brilliant clouds Bedew the rush and the grass. The way of Heaven is hard and difficult;— This man does not conform (to good principle).

source: 文王在上，於昭于天。周雖舊邦，其命維新。 有周不顯，帝命不時。文王陟降，在帝左右。
en: King Wăn is on high. Oh! bright is he in heaven. Although Kâu was an old country, The (favouring) appointment lighted on it recently. Illustrious was the House of Kâu, And the ​appointment of God came at the proper season. King Wăn ascends and descends On the left and the right of God.

source: 亹亹文王，令聞不已。陳錫哉周，侯文王孫子。 文王孫子，本支百世。凡周之士，不顯亦世。
en: Full of earnest activity was king Wăn, And his fame is without end. The gifts (of God) to Kâu Extend to the descendants of king Wăn⟨;— To the descendants of king Wăn⟩, In the direct line and the collateral branches for a hundred generations. All the officers of Kâu Shall (also) be illustrious from age to age.

source: 世之不顯，厥猶翼翼。思皇多士，生此王國。 王國克生，維周之楨。濟濟多士，文王以寧。
en: They shall be illustrious from age to age, Zealously and reverently pursuing their plans. Admirable are the many officers, Born in this royal kingdom. The royal kingdom is able to produce them, The supporters of (the House of) Kâu. Numerous is the array of officers, And by them king Wăn enjoys his repose.

source: 穆穆文王，於緝熙敬止。假哉天命，有商孫子。 商之孫子，其麗不億。上帝既命，侯于周服。
en: Profound was king Wăn; Oh! continuous and bright was his feeling of reverence. Great is the appointment of Heaven! There were the descendants of (the sovereigns of) Shang— The descendants of the sovereigns of Shang Were in number more ​than hundreds of thousands. But when God gave the command, They became subject to Kâu.

source: 侯服于周，天命靡常。殷士膚敏，祼將于京。 厥作祼將，常服黼冔。王之藎臣，無念爾祖。
en: They became subject to Kâu, (For) the appointment of Heaven is not unchangeable. The officers of Yin, admirable and alert, Assist at the libations in our capital. They assist at those libations, Always wearing the hatchet-figures on their lower garments and their peculiar cap. O ye loyal ministers of the king, Ever think of your ancestor!

source: 無念爾祖，聿脩厥德。永言配命，自求多福。 殷之未喪師，克配上帝。宜鑒于殷，駿命不易。
en: Ever think of your ancestor, Cultivating your virtue, Always seeking to accord with the will (of Heaven):— So shall you be seeking for much happiness, Before Yin lost the multitudes, (Its kings) were the correlates of God. Look to Yin as a beacon; The great appointment is not easily preserved.

source: 命之不易，無遏爾躬。宣昭義問，有虞殷自天。 上天之載，無聲無臭。儀刑文王，萬邦作孚。
en: The appointment is not easily (preserved):— Do not cause your own extinction. Display and make bright your righteousness and fame, And look at (the fate of) Yin in the light of Heaven. The doings of high Heaven Have neither sound nor ​smell. Take your pattern from king Wăn, And the myriad regions will repose confidence in you.

source: 明明在下，赫赫在上。天難忱斯，不易維王。天位殷適，使不挾四方。
en: The illustration of illustrious (virtue) is required below, And the dread majesty is on high. Heaven is not readily to be relied on; It is not easy to be king. Yin's rightful heir to the heavenly seat Was not permitted to possess the kingdom.

source: 摯仲氏任，自彼殷商，來嫁于周。曰嬪于京，乃及王季，維德之行。大任有身，生此文王。
en: Zăn, the second of the princesses of Kih, From (the domain of) Yin-shang, Came to be married to (the prince of) Kâu, And became his wife in his ​capital. Both she and king Kî Were entirely virtuous. (Then) Thâi-zăn became pregnant, And gave birth to our king Wăn.

source: 維此文王，小心翼翼。昭事上帝，聿懷多福。厥德不回，以受方國。
en: This king Wăn, Watchfully and reverently, With entire intelligence served God, And so secured the great blessing. His virtue was without deflection; And in consequence he received (the allegiance of) the states from all quarters.

source: 天監在下，有命既集。文王初載，天作之合。在洽之陽，在渭之涘。文王嘉止，大邦有子。
en: Heaven surveyed this lower world; And its appointment lighted (on king Wăn). In his early years, It made for him a mate;— On the north of the Hsiâ, On the banks of the Wei. When king Wăn would marry, There was the lady in a large state.

source: 大邦有子，俔天之妹。文定厥祥，親迎于渭。造舟為梁，不顯其光。
en: In a large state was the lady, Like a fair denizen of heaven. The ceremonies determined the auspiciousness (of the union), And in person he met her on the Wei. Over it he made a bridge of boats; The glory (of the occasion) was illustrious.

source: 有命自天，命此文王。于周于京，纘女維莘。長子維行，篤生武王。保右命爾，燮伐大商。
en: The favouring appointment was from Heaven, Giving the throne to our king Wăn, In the capital of Kâu. The lady-successor was from Hsin, Its eldest daughter, who came to marry him. She was blessed to give birth to king Wû, Who was preserved, and helped, and received (also) the appoint​ment, And in accordance with it smote the great Shang.

source: 殷商之旅，其會如林。矢于牧野，維予侯興。上帝臨女，無貳爾心。
en: The troops of Yin-shang Were collected like a forest, And marshalled in the wilderness of Mû. We rose (to the crisis); 'God is with you,' (said Shang-fû to the king), 'Have no doubts in your heart.'

source: 牧野洋洋，檀車煌煌，駟騵彭彭。維師尚父，時維鷹揚。涼彼武王，肆伐大商。會朝清明。
en: The wilderness of Mû spread out extensive; Bright shone the chariots of sandal; The teams of bays, black-maned and white-bellied, galloped along; The Grand-Master Shang-fû Was like an eagle on the wing, Assisting king Wû, Who at one onset smote the great Shang. That morning's encounter was followed by a clear, bright (day).

source: 緜緜瓜瓞，民之初生，自土沮漆。古公亶父，陶復陶宂，未有家室。 古公亶父，來朝走馬。率西水滸，至于岐下。爰及姜女，聿來胥宇。 周原膴膴，堇荼如飴。爰始爰謀，爰契我龜。曰止曰時，築室于茲。 廼慰廼止，廼左廼右。廼疆廼理，廼宣廼畝。自西徂東，周爰執事。 乃召司空，乃召司徒。俾立室家，其繩則直。縮版以載，作廟翼翼。 捄之陾陾，度之薨薨。築之登登，削屢馮馮。百堵皆興，鼛鼓弗勝。 廼立皐門，皐門有伉。廼立應門，應門將將。廼立冢土，戎醜攸行。 肆不殄厥慍，亦不隕厥問。柞棫拔矣，行道兌矣。混夷駾矣，維其喙矣。 虞芮質厥成，文王蹶厥生。予曰有疏附，予曰有先後。予曰有奔奏，予曰有禦侮。
en: In long trains ever increasing grow the gourds. When (our) people first sprang, From the country about the Khü and the Khî, The ancient duke ​Than-fû Made for them kiln-like huts and caves, Ere they had yet any houses. The ancient duke Than-fû Came in the morning, galloping his horses, Along the banks of the western rivers, To the foot of mount Khî; And there he and the lady Kiang Came and together looked out for a site. The plain of Kâu looked beautiful and rich, With its violets, and sowthistles (sweet) as dumplings. There he began by consulting (with his followers); There he singed the tortoise-shell, (and divined). The responses were there to stay and then; And they proceeded there to build. He encouraged the people, and settled them; Here on the left, there on the right. He divided the ground, and subdivided it; He dug the ditches; he defined the acres. From the east to the west, There was nothing which he did not take in hand.

source: 芃芃棫樸，薪之槱之。濟濟辟王，左右趣之。 濟濟辟王，左右奉璋。奉璋峨峨，髦士攸宜。 淠彼涇舟，烝徒楫之。周王于邁，六師及之。 倬彼雲漢，為章于天。周王壽考，遐不作人。 追琢其章，金玉其相。勉勉我王，綱紀四方。
en: Abundant is the growth of the buckthorn and shrubby trees, Supplying firewood; yea, stores of it. Elegant and dignified was our prince and king; On the left and the right they hastened to him. Elegant and dignified was our prince and king; On his left and his right they bore their half-mace (libation-cups):— They bore them with solemn gravity, As beseemed such eminent officers.

source: 瞻彼旱麓，榛楛濟濟。豈弟君子，干祿豈弟。
en: Look at the foot of the Han, How abundantly grow the hazel and arrow-thorn. Easy and self-possessed was our prince, In his pursuit of dignity (still) easy and self-possessed.

source: 瑟彼玉瓚，黃流在中。豈弟君子，福祿攸降。
en: Massive is that libation-cup of jade, With the ​yellow liquid sparkling in it. Easy and self-possessed was our prince, The fit recipient of blessing and dignity.

source: 鳶飛戾天，魚躍于淵。豈弟君子，遐不作人。
en: The hawk flies up to heaven, The fishes leap in the deep. Easy and self-possessed was our prince:— Did he not exert an influence on men?

source: 清酒既載，騂牡既備。以享以祀，以介景福。
en: His clear spirits were in the vessels; His red bull was ready;— To offer, to sacrifice, To increase his bright happiness.

source: 瑟彼柞棫，民所燎矣。豈弟君子，神所勞矣。
en: Thick grow the oaks and the buckthorn, Which the people use for fuel. Easy and self-possessed was our prince, Cheered and encouraged by the spirits.

source: 莫莫葛藟，施于條枚。豈弟君子，求福不回。
en: Luxuriant are the dolichos and other creepers, Clinging to the branches and stems. Easy and self-possessed was our prince, Seeking for happiness by no crooked ways.

source: 思齊大任，文王之母，思媚周姜。京室之婦，大姒嗣徽音，則百斯男。
en: Pure and reverent was Thâi Zăn, The mother of king Wăn. Loving was she to Kâu Kiang;— ​A wife becoming the House of Kâu. Thâi Sze inherited her excellent fame, And from her came a hundred sons.

source: 惠于宗公，神罔時怨，神罔時恫。刑于寡妻，至于兄弟，以御于家邦。
en: He conformed to the example of his ancestors, And their spirits had no occasion for complaint. Their spirits had no occasion for dissatisfaction; And his example acted on his wife, Extended to his brethren, And was felt by all the clans and states.

source: 雝雝在宮，肅肅在廟。不顯亦臨，無射亦保。
en: Full of harmony was he in his palace; Full of reverence in the ancestral temple. Unseen (by men), he still felt that he was under inspection: Unweariedly he maintained his virtue.

source: 肆戎疾不殄，烈假不瑕。不聞亦式，不諫亦入。
en: Though he could not prevent (some) great calamities, His brightness and magnanimity were without stain. Without previous instruction he did what was right; Without admonition he went on (in the path of goodness).

source: 肆成人有德，小子有造。古之人無斁，譽髦斯士。
en: So, grown up men became virtuous (through him), And young men made (constant) attainments. (Our) ancient prince never felt weariness, And from him were the fame and eminence of his officers.

source: 皇矣上帝，臨下有赫。監觀四方，求民之莫。 維此二國，其政不獲。維彼四國，爰究爰度。 上帝耆之，憎其式廓。乃眷西顧，此維與宅。
en: Great is God, Beholding this lower world in majesty. He surveyed the four quarters (of the kingdom), Seeking for some one to give establishment to the people. Those two earlier dynasties Had failed to satisfy him with their government; So, throughout the various states, He sought and considered For one on whom he might confer the rule. Hating all the great states, He turned his kind regards on the west, And there gave a settlement (to king Thâi).

source: 作之屏之，其菑其翳。脩之平之，其灌其栵。 啟之辟之，其檉其椐。攘之剔之，其檿其柘。 帝遷明德，串夷載路，天立厥配，受命既固。
en: (King Thâi) raised up and removed The dead trunks and the fallen trees. He dressed and regulated The bushy clumps and the (tangled) rows. He opened up and cleared The tamarisk trees and the stave trees. He hewed and thinned The mountain mulberry trees. God having brought about the removal thither of this intelligent ruler, The Kwan hordes fled away. Heaven had raised up a helpmeet for him, And the appointment he had received was made sure.

source: 帝省其山，柞棫斯拔，松柏斯兌。 帝作邦作對。自大伯王季。 維此王季，因心則友。則友其兄，則篤其慶。 載錫之光。受祿無喪，奄有四方。
en: God surveyed the hills, Where the oaks and the buckthorn were thinned, And paths made through the firs and cypresses. God, who had raised the ​state, raised up a proper ruler for it,— From the time of Thâi-po and king Kî (this was done). Now this king Kî In his heart was full of brotherly duty. Full of duty to his elder brother, He gave himself the more to promote the prosperity (of the country), And secured to him the glory (of his act). He accepted his dignity and did not lose it, And (ere long his family) possessed the whole kingdom.

source: 維此王季，帝度其心。貊其德音，其德克明。 克明克類，克長克君。王此大邦，克順克比。 比于文王，其德靡悔，既受帝祉，施于孫子。
en: This king Kî Was gifted by God with the power of judgment, So that the fame of his virtue silently grew. His virtue was highly intelligent,— Highly intelligent, and of rare discrimination; Able to lead, able to rule, To rule over this great country; Rendering a cordial submission, effecting a cordial union. When (the sway) came to king Wăn, His ​virtue left nothing to be dissatisfied with, He received the blessing of God, And it was extended to his descendants.

source: 帝謂文王：無然畔援，無然歆羨，誕先登于岸。 密人不恭，敢距大邦，侵阮徂共。 王赫斯怒，爰整其旅，以按徂旅，以篤于周祜，以對于天下。
en: God said to king Wăn, 'Be not like those who reject this and cling to that; Be not like those who are ruled by their likings and desires;' So he grandly ascended before others to the height (of virtue). The people of Mî were disobedient, Daring to oppose our great country, And invaded Yüan, marching to Kung. The king rose, majestic in his wrath; He marshalled his troops, To stop the invading foes; To consolidate the prosperity of Kâu; To meet the expectations of all under heaven.

source: 依其在京，侵自阮疆，陟我高岡。 無矢我陵，我陵我阿，無飲我泉，我泉我池。 度其鮮原，居岐之陽，在渭之將，萬邦之方，下民之王。
en: He remained quietly in the capital, But (his troops) went on from the borders of Yüan. They ascended our lofty ridges, And (the enemy) arrayed no forces on our hills, On our hills, small or large, Nor drank at our springs, Our springs or our pools. He then determined the finest of the plains, And settled on the south of Khî, On the banks of ​the Wei, The centre of all the states, The resort of the lower people.

source: 帝謂文王：予懷明德。不大聲以色，不長夏以革，不識不知，順帝之則。 帝謂文王：詢爾仇方。同爾兄弟，以爾鉤援，與爾臨衝，以伐崇墉。
en: God said to king Wăn, 'I am pleased with your intelligent virtue, Not loudly proclaimed nor pourtrayed, Without extravagance or changeableness, Without consciousness of effort on your part, In accordance with the pattern of God.' God said to king Wăn, 'Take measures against the country of your foes. Along with your brethren, Get ready your scaling ladders, And your engines of onfall and assault, To attack the walls of Khung.'

source: 臨衝閑閑，崇墉言言。執訊連連，攸馘安安。是類是禡，是致是附。四方以無侮。 臨衝茀茀，崇墉仡仡。是伐是肆，是絕是忽。四方以無拂。
en: The engines of onfall and assault were (at first) gently plied, Against the walls of Khung high and great; Captives for the question were brought in, one after another; The left ears (of the slain) were taken leisurely. He had sacrificed to God and to the Father of War, Thus seeking to induce ​submission, And throughout the region none had dared to insult him. The engines of onfall and assault were (then) vigorously plied, Against the walls of Khung very strong. He attacked it, and let loose all his forces; He extinguished (its sacrifices), and made an end of its existence; And throughout the kingdom none dared to oppose him.

source: 下武維周，世有哲王。三后在天，王配于京。
en: Successors tread in the steps (of their predecessors) in our Kâu. For generations there had been wise kings; The three sovereigns were in heaven; And king (Wû) was their worthy successor in his capital.

source: 王配于京，世德作求。永言配命，成王之孚。
en: King (Wû) was their worthy successor in his capital, Rousing himself to seek for the hereditary virtue, Always striving to be in accordance with the ​will (of Heaven); And thus he secured the confidence due to a king.

source: 成王之孚，下土之式。永言孝思，孝思維則。
en: He secured the confidence due to a king, And became the pattern of all below him. Ever thinking how to be filial, His filial mind was the model (which he supplied).

source: 媚茲一人，應侯順德。永言孝思，昭哉嗣服。
en: Men loved him, the One man, And responded (to his example) with a docile virtue. Ever thinking how to be filial, He brilliantly continued the doings (of his fathers).

source: 昭茲來許，繩其祖武。於萬斯年，受天之祜。
en: Brilliantly! and his posterity, Continuing to walk in the steps of their forefathers, For myriads of years, Will receive the blessing of Heaven.

source: 受天之祜，四方來賀。於萬斯年，不遐有佐。
en: They will receive the blessing of Heaven, And from the four quarters (of the kingdom) will felicitations come to them. For myriads of years Will there not be their helpers?

source: 文王有聲，遹駿有聲。遹求厥寧，遹觀厥成。文王烝哉。 文王受命，有此武功。既伐于崇，作邑于豐。文王烝哉。 築城伊淢，作豐伊匹。匪棘其欲，遹追來孝。王后烝哉。 王公伊濯，維豐之垣。四方攸同，王后維翰。王后烝哉。
en: King Wăn is famous; Yea, he is very famous. What he sought was the repose (of the people); What he saw was the completion (of his work). A sovereign true was king Wăn!

source: 豐水東注，維禹之績。四方攸同，皇王維辟。皇王烝哉。 鎬京辟廱，自西自東。自南自北，無思不服。皇王烝哉。 考卜維王，宅是鎬京。維龜正之，武王成之。武王烝哉。 豐水有芑，武王豈不仕。詒厥孫謀，以燕翼子。武王烝哉。
en: King Wăn received the appointment (from Heaven), And achieved his martial success. Having overthrown Khung He fixed his (capital) city in Făng. A sovereign true was king Wăn!

source: 厥初生民，時維姜嫄。生民如何？克禋克祀，以弗無子。 履帝武敏歆，攸介攸止。載震載夙，載生載育。時維后稷。 誕彌厥月，先生如達。不坼不副，無菑無害。 以赫厥靈，上帝不寧。不康禋祀，居然生子。 誕寘之隘巷，牛羊腓字之。誕寘之平林，會伐平林。 誕寘之寒冰，鳥覆翼之。鳥乃去矣，后稷呱矣。 實覃實訏，厥聲載路。誕實匍匐，克岐克嶷，以就口食。 蓺之荏菽，荏菽斾斾，禾役穟穟。麻麥幪幪，瓜瓞唪唪。 誕后稷之穡，有相之道。茀厥豐草，種之黃茂。 實方實苞，實種實褎，實發實秀，實堅實好，實穎實栗。即有邰家室。 誕降嘉種，維秬維秠，維穈維芑。 恒之秬秠，是穫是畝。恒之穈芑，是任是負。以歸肇祀。 誕我祀如何？或舂或揄，或簸或蹂。釋之叟叟，烝之浮浮。 載謀載惟，取蕭祭脂，取羝以軷。載燔載烈，以興嗣歲。 卬盛于豆，于豆于登。其香始升，上帝居歆。 胡臭亶時？后稷肇祀，庶無罪悔，以迄于今。
en: The first birth of (our) people Was from Kiang Yüan. How did she give birth to (our) people? She had presented a pure offering and sacrificed, ​That her childlessness might be taken away. She then trod on a toe-print made by God, and was moved, In the large place where she rested. She became pregnant; she dwelt retired; She gave birth to, and nourished (a son), Who was Hâu-kî. When she had fulfilled her months, Her firstborn son (came forth) like a lamb. There was no bursting, nor rending, No injury, no hurt; Showing how wonderful he would be. Did not God give her the comfort? w Had he not accepted her pure offering and sacrifice, So that thus easily she brought forth her son? He was placed in a narrow lane, But the sheep and oxen protected him with loving care. He was placed in a wide forest, Where he was met with by the wood-cutters. He was placed on the cold ice, And a bird screened and supported him with its wings. When the bird went away, Hâu-kî began to wail. His cry was long and loud, So that his voice filled the whole way.

source: 敦彼行葦，牛羊勿踐履。方苞方體，維葉泥泥。 戚戚兄弟，莫遠具爾。或肆之筵，或授之几。
en: In thick patches are those rushes, Springing by the way-side:— Let not the cattle and sheep trample them. Anon they will grow up; anon they will be completely formed, With their leaves soft and glossy. Closely related are brethren; Let none be absent, let all be near. For some there are mats spread; For some there are given stools.

source: 肆筵設席，授几有緝御。或獻或酢，洗爵奠斝。 醓醢以薦，或燔或炙。嘉殽脾臄，或歌或咢。
en: The mats are spread, and a second one above; The stools are given, and there are plenty of servants. (The guests) are pledged, and they pledge (the host) in return; He rinses the cups (and refills them, but the guests) put them down, Sauces and pickles are brought in, With roasted meat and broiled. Excellent provisions there are of tripe and palates; With singing to lutes, and with drums.

source: 敦弓既堅，四鍭既鈞。舍矢既均，序賓以賢。 敦弓既句，既挾四鍭。四鍭如樹，序賓以不侮。
en: The ornamented bows are strong, And the four arrows are all balanced. They discharge the arrows, and all hit, And the guests are arranged according to their skill. The ornamented bows are drawn to the full, And the arrows are grasped in the hand. They go straight to the mark as if planted ​in it, And the guests are arranged according to the humble propriety of their behaviour.

source: 曾孫維主，酒醴維醹。酌以大斗，以祈黃耇。 黃耇台背，以引以翼，壽考維祺，以介景福。
en: The distant descendant presides over the feast; His sweet spirits are strong. He fills their cups from a large vase, And prays for the hoary old (among his guests):— That with hoary age and wrinkled back, They may lead on one another (to virtue), and support one another (in it); That so their old age may be blessed, And their bright happiness ever increased.

source: 既醉以酒，既飽以德。君子萬年，介爾景福。
en: You have made us drink to the full of your spirits; You have satiated us with your kindness. May you enjoy, O our lord, myriads of years! May your bright happiness (ever) be increased!

source: 既醉以酒，爾殽既將。君子萬年，介爾昭明。
en: You have made us drink to the full of your spirits; Your viands were set out before us. May you enjoy, O our lord, myriads of years! May your bright intelligence ever be increased!

source: 昭明有融，高朗令終。令終有俶，公尸嘉告。
en: May your bright intelligence become perfect, High and brilliant, leading to a good end! That good end has (now) its beginning:— The personators of your ancestors announced it in their blessing.

source: 其告維何？籩豆靜嘉。朋友攸攝，攝以威儀。
en: What was their announcement? '(The offerings) in your dishes of bamboo and wood are clean and ​fine. Your friends, assisting in the service, Have done their part with reverent demeanour.

source: 威儀孔時，君子有孝子。孝子不匱，永錫爾類。
en: 'Your reverent demeanour was altogether what the occasion required; And also that of your filial son. For such filial piety, continued without ceasing, There will ever be conferred blessings upon you.'

source: 其類維何？室家之壼。君子萬年，永錫祚胤。
en: What will the blessings be? 'That along the passages of your palace, You shall move for ten thousand years, And there will be granted to you for ever dignity and posterity.'

source: 其胤維何？天被爾祿。君子萬年，景命有僕。
en: How as to your posterity? 'Heaven invests you with your dignity; Yea, for ten thousand years, The bright appointment is attached (to your line).'

source: 其僕維何？釐爾女士。釐爾女士，從以孫子。
en: How is it attached? 'There is given you a heroic wife. There is given you a heroic wife, And from her shall come the (line of) descendants.'
